Revit 2027 API
BuiltInFailures.KeyBasedTreeEntryFailures.MissingParent Property
 No parent [EntryType] '[Code]' for '[Code]'
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MissingParent { get; }
Public Shared ReadOnly Property MissingParent As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MissingParent {
	FailureDefinitionId^ get ();
}
static member MissingParent : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.KeyBasedTreeEntryFailures Class
Autodesk.Revit.DB Namespace